In [2]:
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

Saving test.csv to test.csv
Saving train.csv to train.csv
User uploaded file "test.csv" with length 28629 bytes
User uploaded file "train.csv" with length 61194 bytes

In [3]:
import pandas as pd
import matplotlib.pyplot as plt

df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')
df_train.shape

(891, 12)

In [4]:
df_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
# data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier

In [6]:
df_test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [7]:
df_train.info()
print('-'*40)
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
----------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [8]:
df_train.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [0]:
le = LabelEncoder()
df_train.loc[:,'Sex'] = le.fit_transform(df_train.loc[:,'Sex'])
df_test.loc[:,'Sex'] = le.fit_transform(df_test.loc[:,'Sex'])

In [10]:
df_train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 12 columns]

In [11]:
df_test.head()

   PassengerId  Pclass  ... Cabin  Embarked
0          892       3  ...   NaN         Q
1          893       3  ...   NaN         S
2          894       2  ...   NaN         Q
3          895       3  ...   NaN         S
4          896       3  ...   NaN         S

[5 rows x 11 columns]

In [0]:
df_train = df_train.drop(['Cabin', 'Ticket', 'PassengerId'], axis=1)
df_test = df_test.drop(['Cabin', 'Ticket'], axis=1)

In [13]:
combine = [df_train, df_test]
combine[0].shape, combine[1].shape

((891, 9), (418, 9))

In [0]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)

In [15]:
pd.crosstab(df_train['Title'], df_train['Sex'])

Sex         0    1
Title
Capt        0    1
Col         0    2
Countess    1    0
Don         0    1
Dr          1    6
Jonkheer    0    1
Lady        1    0
Major       0    2
Master      0   40
Miss      182    0
Mlle        2    0
Mme         1    0
Mr          0  517
Mrs       125    0
Ms          1    0
Rev         0    6
Sir         0    1

In [0]:
for dataset in combine:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')

In [17]:
df_train[['Title', 'Survived']].groupby(['Title'], as_index = False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [0]:
for dataset in combine:
    dataset['Title'] = le.fit_transform(dataset['Title'])

In [19]:
for dataset in combine:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
    
df_train[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

   FamilySize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

In [20]:
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1
    
df_train[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index = False).mean().sort_values(by = 'Survived', ascending = False)

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [0]:
df_train = df_train.drop(['Name', 'SibSp', 'Parch', 'FamilySize'], axis=1)
df_test = df_test.drop(['Name', 'SibSp', 'Parch', 'FamilySize'], axis=1)

In [22]:
df_train.shape, df_test.shape

((891, 8), (418, 8))

In [23]:
freq = df_train.Embarked.dropna().mode()[0]
freq

'S'

In [0]:
df_train['Embarked'] = df_train['Embarked'].fillna(freq)

In [25]:
df_train[['Embarked', 'Survived']].groupby(['Embarked']).mean()

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.339009

In [26]:
df_train.Embarked.describe(include = [0])

count     891
unique      3
top         S
freq      646
Name: Embarked, dtype: object

In [0]:
for dataset in combine:
    dataset['Embarked'].dropna()

In [28]:
df_test['Embarked'] = df_test['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

df_test.head()

   PassengerId  Pclass  Sex   Age     Fare  Embarked  Title  IsAlone
0          892       3    1  34.5   7.8292         2      2        1
1          893       3    0  47.0   7.0000         0      3        0
2          894       2    1  62.0   9.6875         2      2        1
3          895       3    1  27.0   8.6625         0      2        1
4          896       3    0  22.0  12.2875         0      3        0

In [29]:
df_train['Embarked'] = df_train['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)
df_train.head()

   Survived  Pclass  Sex   Age     Fare  Embarked  Title  IsAlone
0         0       3    1  22.0   7.2500         0      2        0
1         1       1    0  38.0  71.2833         1      3        0
2         1       3    0  26.0   7.9250         0      1        1
3         1       1    0  35.0  53.1000         0      3        0
4         0       3    1  35.0   8.0500         0      2        1

In [0]:
df_test['Fare'] = df_test.Fare.fillna(df_test.Fare.dropna().median())

In [31]:
df_train['FareBand'] = pd.qcut(df_test.Fare, 4)
df_train[['FareBand', 'Survived']].groupby(['FareBand'], as_index = False).mean()

            FareBand  Survived
0    (-0.001, 7.896]  0.456140
1    (7.896, 14.454]  0.402062
2   (14.454, 31.472]  0.343137
3  (31.472, 512.329]  0.352381

In [32]:
df_train.loc[df_train['Fare'] <= 7.9, 'Fare'] = 0
df_train.loc[(df_train['Fare'] > 7.9) & (df_train['Fare'] <= 14.4) , 'Fare'] = 1
df_train.loc[(df_train['Fare'] > 14.4) & (df_train['Fare'] <= 31.5), 'Fare'] = 2
df_train.loc[df_train['Fare'] > 31.5, 'Fare'] = 3
df_train['Fare'] = df_train['Fare'].astype(int)

df_test.loc[df_test['Fare'] <= 7.9, 'Fare'] = 0
df_test.loc[(df_test['Fare'] > 7.9) & (df_test['Fare'] <= 14.4) , 'Fare'] = 1
df_test.loc[(df_test['Fare'] > 14.4) & (df_test['Fare'] <= 31.5), 'Fare'] = 2
df_test.loc[df_test['Fare'] > 31.5, 'Fare'] = 3
df_test['Fare'] = df_test['Fare'].astype(int)
df_train.head()

   Survived  Pclass  Sex   Age  Fare  Embarked  Title  IsAlone         FareBand
0         0       3    1  22.0     0         0      2        0  (-0.001, 7.896]
1         1       1    0  38.0     3         1      3        0  (-0.001, 7.896]
2         1       3    0  26.0     1         0      1        1  (7.896, 14.454]
3         1       1    0  35.0     3         0      3        0  (7.896, 14.454]
4         0       3    1  35.0     1         0      2        1  (7.896, 14.454]

In [33]:
df_train['AgeBand'] = pd.cut(df_test.Age, 5)
df_train[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index = False).mean()

            AgeBand  Survived
0  (0.0942, 15.336]  0.281250
1  (15.336, 30.502]  0.434524
2  (30.502, 45.668]  0.325000
3  (45.668, 60.834]  0.357143
4    (60.834, 76.0]  0.500000

In [0]:
df_train.loc[df_train['Age'] <= 15.3, 'Age'] = 0
df_train.loc[(df_train['Age'] > 15.3) & (df_train['Age'] <= 30.5) , 'Age'] = 1
df_train.loc[(df_train['Age'] > 30.5) & (df_train['Age'] <= 45.7), 'Age'] = 2
df_train.loc[(df_train['Age'] > 45.7) & (df_train['Age'] <= 60.8), 'Age'] = 3
df_train.loc[df_train['Age'] > 60.8, 'Age'] = 4

df_test.loc[df_test['Age'] <= 15.3, 'Age'] = 0
df_test.loc[(df_test['Age'] > 15.3) & (df_test['Age'] <= 30.5) , 'Age'] = 1
df_test.loc[(df_test['Age'] > 30.5) & (df_test['Age'] <= 45.7), 'Age'] = 2
df_test.loc[(df_test['Age'] > 45.7) & (df_test['Age'] <= 60.8), 'Age'] = 3
df_test.loc[df_test['Age'] > 60.8, 'Age'] = 4

In [35]:
df_test.head()

   PassengerId  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0          892       3    1  2.0     0         2      2        1
1          893       3    0  3.0     0         0      3        0
2          894       2    1  4.0     1         2      2        1
3          895       3    1  1.0     1         0      2        1
4          896       3    0  1.0     1         0      3        0

In [36]:
df_train = df_train.drop(['FareBand'], axis=1)
df_train.head()

   Survived  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone           AgeBand
0         0       3    1  1.0     0         0      2        0  (30.502, 45.668]
1         1       1    0  2.0     3         1      3        0  (45.668, 60.834]
2         1       3    0  1.0     1         0      1        1    (60.834, 76.0]
3         1       1    0  2.0     3         0      3        0  (15.336, 30.502]
4         0       3    1  2.0     1         0      2        1  (15.336, 30.502]

In [37]:
Y_train = df_train['Survived']
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [38]:
X_train = df_train.drop(['Survived'], axis=1)
X_train.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone           AgeBand
0       3    1  1.0     0         0      2        0  (30.502, 45.668]
1       1    0  2.0     3         1      3        0  (45.668, 60.834]
2       3    0  1.0     1         0      1        1    (60.834, 76.0]
3       1    0  2.0     3         0      3        0  (15.336, 30.502]
4       3    1  2.0     1         0      2        1  (15.336, 30.502]

In [0]:
X_test = df_test.drop(['PassengerId'], axis=1)

In [40]:
guess_ages = np.zeros((2,3))
guess_ages

array([[0., 0., 0.],
       [0., 0., 0.]])

In [41]:
for i in range(0, 2):
    for j in range(0, 3):
        guess_df = X_train[(X_train['Sex'] == i) & (X_train['Pclass'] == j+1)]['Age'].dropna()

        # age_mean = guess_df.mean()
        # age_std = guess_df.std()
        # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)

        age_guess = guess_df.median()

        # Convert random age float to nearest .5 age
        guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5

for i in range(0, 2):
    for j in range(0, 3):
        X_train.loc[ (X_train.Age.isnull()) & (X_train.Sex == i) & (X_train.Pclass == j+1),'Age'] = guess_ages[i,j]

X_train['Age'] = X_train['Age'].astype(int)

X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null int64
Fare        891 non-null int64
Embarked    891 non-null int64
Title       891 non-null int64
IsAlone     891 non-null int64
AgeBand     332 non-null category
dtypes: category(1), int64(7)
memory usage: 49.8 KB

In [42]:
for i in range(0, 2):
    for j in range(0, 3):
        guess_df = X_test[(X_test['Sex'] == i) & (X_test['Pclass'] == j+1)]['Age'].dropna()

        # age_mean = guess_df.mean()
        # age_std = guess_df.std()
        # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)

        age_guess = guess_df.median()

        # Convert random age float to nearest .5 age
        guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5

for i in range(0, 2):
    for j in range(0, 3):
        X_test.loc[ (X_test.Age.isnull()) & (X_test.Sex == i) & (X_test.Pclass == j+1),'Age'] = guess_ages[i,j]

X_test['Age'] = X_test['Age'].astype(int)

X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass      418 non-null int64
Sex         418 non-null int64
Age         418 non-null int64
Fare        418 non-null int64
Embarked    418 non-null int64
Title       418 non-null int64
IsAlone     418 non-null int64
dtypes: int64(7)
memory usage: 22.9 KB

In [43]:
X_train = X_train.drop(['AgeBand'], axis=1)
X_train.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0       3    1    1     0         0      2        0
1       1    0    2     3         1      3        0
2       3    0    1     1         0      1        1
3       1    0    2     3         0      3        0
4       3    1    2     1         0      2        1

In [44]:
X_train.shape

(891, 7)

In [45]:
one = OneHotEncoder(categorical_features = [0,2,3,4,5])
X_train = one.fit_transform(X_train).toarray()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:451: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

In [0]:
X_train = X_train[:,[1,2,3,5,6,7,8,10,11,12,14,15,17,18,19,20,21]]

In [47]:
one = OneHotEncoder(categorical_features = [0,2,3,4,5])
X_test = one.fit_transform(X_test).toarray()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_encoders.py:451: DeprecationWarning: The 'categorical_features' keyword is deprecated in version 0.20 and will be removed in 0.22. You can use the ColumnTransformer instead.
  "use the ColumnTransformer instead.", DeprecationWarning)

In [0]:
X_test = X_test[:,[1,2,3,5,6,7,8,10,11,12,14,15,17,18,19,20,21]]

In [49]:
X_test.shape

(418, 17)

In [50]:
logreg = LogisticRegression()
logreg.fit(X_train, Y_train)
Y_pred = logreg.predict(X_test)
x = round(logreg.score(X_train, Y_train), 2)
x

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

0.82

In [51]:
sv = SVC()
sv.fit(X_train, Y_train)
Y_pred1 = sv.predict(X_test)
x1 = round(logreg.score(X_train, Y_train), 2)
x1

/usr/local/lib/python3.6/dist-packages/sklearn/svm/base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

0.82

In [52]:
rfc = RandomForestClassifier()
rfc.fit(X_train, Y_train)
Y_pred2 = rfc.predict(X_test)
x2 = round(logreg.score(X_train, Y_train), 2)
x2

/usr/local/lib/python3.6/dist-packages/sklearn/ensemble/forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

0.82

In [53]:
rfc = KNeighborsClassifier(n_neighbors=5)
rfc.fit(X_train, Y_train)
Y_pred3 = rfc.predict(X_test)
x3 = round(logreg.score(X_train, Y_train), 2)
x3

0.82

In [54]:
#Classification using Artificial Neural Networks
import keras
from keras.models import Sequential
from keras.layers import Dense

Using TensorFlow backend.

In [55]:
classifier = Sequential()
classifier.add(Dense(units=32, kernel_initializer='uniform', activation='relu', input_dim=17))
classifier.add(Dense(units=32, kernel_initializer='uniform', activation='relu'))
classifier.add(Dense(units=32, kernel_initializer='uniform', activation='relu'))
classifier.add(Dense(units=1, kernel_initializer='uniform', activation='sigmoid'))
classifier.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])

WARNING: Logging before flag parsing goes to stderr.
W0620 14:58:34.521456 139802301708160 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:74: The name tf.get_default_graph is deprecated. Please use tf.compat.v1.get_default_graph instead.

W0620 14:58:34.565885 139802301708160 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:517: The name tf.placeholder is deprecated. Please use tf.compat.v1.placeholder instead.

W0620 14:58:34.574905 139802301708160 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:4138: The name tf.random_uniform is deprecated. Please use tf.random.uniform instead.

W0620 14:58:34.637983 139802301708160 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/optimizers.py:790: The name tf.train.Optimizer is deprecated. Please use tf.compat.v1.train.Optimizer instead.

W0620 14:58:34.664007 139802301708160 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:3376: The name tf.log is deprecated. Please use tf.math.log instead.

W0620 14:58:34.672741 139802301708160 deprecation.py:323] From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/nn_impl.py:180: add_dispatch_support.<locals>.wrapper (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where

In [74]:
classifier.fit(X_train, Y_train, batch_size=10, epochs=100)

pred = classifier.predict(X_test)

Epoch 1/100
891/891 [==============================] - 0s 448us/step - loss: 0.3070 - acc: 0.8597
Epoch 2/100
891/891 [==============================] - 0s 438us/step - loss: 0.3057 - acc: 0.8631
Epoch 3/100
891/891 [==============================] - 0s 487us/step - loss: 0.3028 - acc: 0.8642
Epoch 4/100
891/891 [==============================] - 0s 503us/step - loss: 0.3044 - acc: 0.8597
Epoch 5/100
891/891 [==============================] - 0s 486us/step - loss: 0.3084 - acc: 0.8664
Epoch 6/100
891/891 [==============================] - 0s 524us/step - loss: 0.3085 - acc: 0.8563
Epoch 7/100
891/891 [==============================] - 0s 491us/step - loss: 0.3074 - acc: 0.8586
Epoch 8/100
891/891 [==============================] - 0s 480us/step - loss: 0.3042 - acc: 0.8608
Epoch 9/100
891/891 [==============================] - 0s 501us/step - loss: 0.3063 - acc: 0.8631
Epoch 10/100
891/891 [==============================] - 0s 492us/step - loss: 0.3049 - acc: 0.8620
Epoch 11/100
891/891 [==============================] - 0s 493us/step - loss: 0.3063 - acc: 0.8575
Epoch 12/100
891/891 [==============================] - 0s 493us/step - loss: 0.3042 - acc: 0.8620
Epoch 13/100
891/891 [==============================] - 0s 490us/step - loss: 0.3046 - acc: 0.8586
Epoch 14/100
891/891 [==============================] - 0s 498us/step - loss: 0.3070 - acc: 0.8563
Epoch 15/100
891/891 [==============================] - 0s 489us/step - loss: 0.3050 - acc: 0.8597
Epoch 16/100
891/891 [==============================] - 0s 501us/step - loss: 0.3045 - acc: 0.8608
Epoch 17/100
891/891 [==============================] - 0s 494us/step - loss: 0.3035 - acc: 0.8608
Epoch 18/100
891/891 [==============================] - 0s 497us/step - loss: 0.3035 - acc: 0.8608
Epoch 19/100
891/891 [==============================] - 0s 487us/step - loss: 0.3063 - acc: 0.8563
Epoch 20/100
891/891 [==============================] - 0s 470us/step - loss: 0.3086 - acc: 0.8563
Epoch 21/100
891/891 [==============================] - 0s 503us/step - loss: 0.3042 - acc: 0.8586
Epoch 22/100
891/891 [==============================] - 0s 492us/step - loss: 0.3041 - acc: 0.8575
Epoch 23/100
891/891 [==============================] - 0s 514us/step - loss: 0.3041 - acc: 0.8597
Epoch 24/100
891/891 [==============================] - 0s 485us/step - loss: 0.3059 - acc: 0.8608
Epoch 25/100
891/891 [==============================] - 0s 509us/step - loss: 0.3062 - acc: 0.8586
Epoch 26/100
891/891 [==============================] - 0s 489us/step - loss: 0.3023 - acc: 0.8653
Epoch 27/100
891/891 [==============================] - 0s 489us/step - loss: 0.3051 - acc: 0.8552
Epoch 28/100
891/891 [==============================] - 0s 498us/step - loss: 0.3066 - acc: 0.8664
Epoch 29/100
891/891 [==============================] - 0s 487us/step - loss: 0.3009 - acc: 0.8597
Epoch 30/100
891/891 [==============================] - 0s 522us/step - loss: 0.3051 - acc: 0.8642
Epoch 31/100
891/891 [==============================] - 0s 494us/step - loss: 0.3044 - acc: 0.8620
Epoch 32/100
891/891 [==============================] - 0s 496us/step - loss: 0.3054 - acc: 0.8575
Epoch 33/100
891/891 [==============================] - 0s 494us/step - loss: 0.3047 - acc: 0.8586
Epoch 34/100
891/891 [==============================] - 0s 490us/step - loss: 0.3025 - acc: 0.8631
Epoch 35/100
891/891 [==============================] - 0s 474us/step - loss: 0.3061 - acc: 0.8563
Epoch 36/100
891/891 [==============================] - 0s 491us/step - loss: 0.3037 - acc: 0.8608
Epoch 37/100
891/891 [==============================] - 0s 497us/step - loss: 0.3072 - acc: 0.8608
Epoch 38/100
891/891 [==============================] - 0s 491us/step - loss: 0.3017 - acc: 0.8552
Epoch 39/100
891/891 [==============================] - 0s 504us/step - loss: 0.3069 - acc: 0.8608
Epoch 40/100
891/891 [==============================] - 0s 489us/step - loss: 0.3044 - acc: 0.8552
Epoch 41/100
891/891 [==============================] - 0s 492us/step - loss: 0.3027 - acc: 0.8642
Epoch 42/100
891/891 [==============================] - 0s 495us/step - loss: 0.3037 - acc: 0.8620
Epoch 43/100
891/891 [==============================] - 0s 468us/step - loss: 0.3030 - acc: 0.8608
Epoch 44/100
891/891 [==============================] - 0s 532us/step - loss: 0.3020 - acc: 0.8563
Epoch 45/100
891/891 [==============================] - 0s 486us/step - loss: 0.3041 - acc: 0.8653
Epoch 46/100
891/891 [==============================] - 0s 501us/step - loss: 0.3040 - acc: 0.8620
Epoch 47/100
891/891 [==============================] - 0s 484us/step - loss: 0.3006 - acc: 0.8664
Epoch 48/100
891/891 [==============================] - 0s 500us/step - loss: 0.3048 - acc: 0.8608
Epoch 49/100
891/891 [==============================] - 0s 489us/step - loss: 0.3015 - acc: 0.8664
Epoch 50/100
891/891 [==============================] - 0s 481us/step - loss: 0.3024 - acc: 0.8620
Epoch 51/100
891/891 [==============================] - 0s 502us/step - loss: 0.3013 - acc: 0.8642
Epoch 52/100
891/891 [==============================] - 0s 479us/step - loss: 0.3030 - acc: 0.8631
Epoch 53/100
891/891 [==============================] - 0s 503us/step - loss: 0.3024 - acc: 0.8575
Epoch 54/100
891/891 [==============================] - 0s 501us/step - loss: 0.3013 - acc: 0.8642
Epoch 55/100
891/891 [==============================] - 0s 494us/step - loss: 0.3067 - acc: 0.8653
Epoch 56/100
891/891 [==============================] - 0s 492us/step - loss: 0.3012 - acc: 0.8664
Epoch 57/100
891/891 [==============================] - 0s 495us/step - loss: 0.3067 - acc: 0.8563
Epoch 58/100
891/891 [==============================] - 0s 501us/step - loss: 0.3017 - acc: 0.8575
Epoch 59/100
891/891 [==============================] - 0s 482us/step - loss: 0.2997 - acc: 0.8620
Epoch 60/100
891/891 [==============================] - 0s 502us/step - loss: 0.3007 - acc: 0.8608
Epoch 61/100
891/891 [==============================] - 0s 486us/step - loss: 0.3013 - acc: 0.8620
Epoch 62/100
891/891 [==============================] - 0s 493us/step - loss: 0.3053 - acc: 0.8575
Epoch 63/100
891/891 [==============================] - 0s 498us/step - loss: 0.3010 - acc: 0.8575
Epoch 64/100
891/891 [==============================] - 0s 490us/step - loss: 0.3007 - acc: 0.8664
Epoch 65/100
891/891 [==============================] - 0s 483us/step - loss: 0.3027 - acc: 0.8631
Epoch 66/100
891/891 [==============================] - 0s 487us/step - loss: 0.2997 - acc: 0.8597
Epoch 67/100
891/891 [==============================] - 0s 501us/step - loss: 0.3001 - acc: 0.8631
Epoch 68/100
891/891 [==============================] - 0s 499us/step - loss: 0.2987 - acc: 0.8653
Epoch 69/100
891/891 [==============================] - 0s 495us/step - loss: 0.3035 - acc: 0.8552
Epoch 70/100
891/891 [==============================] - 0s 485us/step - loss: 0.3025 - acc: 0.8620
Epoch 71/100
891/891 [==============================] - 0s 488us/step - loss: 0.3023 - acc: 0.8653
Epoch 72/100
891/891 [==============================] - 0s 508us/step - loss: 0.3004 - acc: 0.8620
Epoch 73/100
891/891 [==============================] - 0s 488us/step - loss: 0.3032 - acc: 0.8586
Epoch 74/100
891/891 [==============================] - 0s 495us/step - loss: 0.3024 - acc: 0.8586
Epoch 75/100
891/891 [==============================] - 0s 481us/step - loss: 0.3008 - acc: 0.8631
Epoch 76/100
891/891 [==============================] - 0s 487us/step - loss: 0.3010 - acc: 0.8597
Epoch 77/100
891/891 [==============================] - 0s 512us/step - loss: 0.3005 - acc: 0.8620
Epoch 78/100
891/891 [==============================] - 0s 501us/step - loss: 0.2995 - acc: 0.8653
Epoch 79/100
891/891 [==============================] - 0s 503us/step - loss: 0.3015 - acc: 0.8597
Epoch 80/100
891/891 [==============================] - 0s 490us/step - loss: 0.2993 - acc: 0.8608
Epoch 81/100
891/891 [==============================] - 0s 492us/step - loss: 0.2997 - acc: 0.8597
Epoch 82/100
891/891 [==============================] - 0s 495us/step - loss: 0.3028 - acc: 0.8586
Epoch 83/100
891/891 [==============================] - 0s 499us/step - loss: 0.2994 - acc: 0.8597
Epoch 84/100
891/891 [==============================] - 0s 517us/step - loss: 0.3018 - acc: 0.8620
Epoch 85/100
891/891 [==============================] - 0s 488us/step - loss: 0.2983 - acc: 0.8620
Epoch 86/100
891/891 [==============================] - 0s 499us/step - loss: 0.3016 - acc: 0.8608
Epoch 87/100
891/891 [==============================] - 0s 492us/step - loss: 0.2986 - acc: 0.8642
Epoch 88/100
891/891 [==============================] - 0s 499us/step - loss: 0.2996 - acc: 0.8653
Epoch 89/100
891/891 [==============================] - 0s 487us/step - loss: 0.3010 - acc: 0.8653
Epoch 90/100
891/891 [==============================] - 0s 500us/step - loss: 0.3004 - acc: 0.8575
Epoch 91/100
891/891 [==============================] - 0s 491us/step - loss: 0.2997 - acc: 0.8653
Epoch 92/100
891/891 [==============================] - 0s 493us/step - loss: 0.2993 - acc: 0.8597
Epoch 93/100
891/891 [==============================] - 0s 509us/step - loss: 0.3011 - acc: 0.8631
Epoch 94/100
891/891 [==============================] - 0s 484us/step - loss: 0.3007 - acc: 0.8597
Epoch 95/100
891/891 [==============================] - 0s 497us/step - loss: 0.3004 - acc: 0.8664
Epoch 96/100
891/891 [==============================] - 0s 497us/step - loss: 0.2985 - acc: 0.8631
Epoch 97/100
891/891 [==============================] - 0s 501us/step - loss: 0.2984 - acc: 0.8575
Epoch 98/100
891/891 [==============================] - 0s 494us/step - loss: 0.3037 - acc: 0.8575
Epoch 99/100
891/891 [==============================] - 0s 487us/step - loss: 0.3029 - acc: 0.8664
Epoch 100/100
891/891 [==============================] - 0s 501us/step - loss: 0.3049 - acc: 0.8631

In [76]:
for i in range(len(pred)):
  if pred[i][0] > 0.5:
    pred[i][0] = 1
  else:
    pred[i][0] = 0
pred = pred.astype('int32')
pd.DataFrame(pred)

     0
0    0
1    0
2    0
3    0
4    1
5    0
6    1
7    0
8    1
9    0
10   0
11   0
12   1
13   0
14   1
15   1
16   0
17   0
18   0
19   0
20   0
21   0
22   1
23   0
24   1
25   0
26   1
27   0
28   1
29   0
..  ..
388  0
389  1
390  1
391  1
392  1
393  0
394  0
395  1
396  0
397  1
398  0
399  0
400  1
401  0
402  1
403  1
404  0
405  1
406  0
407  0
408  1
409  1
410  1
411  1
412  1
413  0
414  1
415  0
416  0
417  1

[418 rows x 1 columns]

In [79]:
pred10 = pred.ravel()
pred10.shape

(418,)

In [0]:
submission = pd.DataFrame({"PassengerId": df_test["PassengerId"],"Survived": Y_pred3})

In [0]:
submission.to_csv('submission.csv', index=False)